In [1]:
import pandas as pd

In [3]:
%pwd

'F:\\neel\\fingertips\\python\\jupyternotbook'

In [7]:
data = pd.read_csv('F:\\neel\\fingertips\\python\\jupyternotbook\\movie.csv',encoding='latin-1')

In [8]:
data

,FF,Title,DIR
0,2005,1990: Bronx Warriors,Enzo Castellari
1,2005,Creep,Christopher Smith
2,2005,Feast,John Gulager
3,2005,G.O.R.A.,ÌÐmer Faruk Sorak
4,2005,Hakugei: Legend of the Moby Dick,Osamu Dezaki
...,...,...,...
904,2017,See You Up There,Albert Dupontel
905,2017,Tabula Rasa,Jonas Govaerts & Kaat Beels / Malin-Sarah Gozin
906,2017,Wizard,Kagiso Lediga
907,2017,"Death of Stalin, The",Armando Iannucci
908,2017,Take It Out in Trade,Edward D. Wood Jr.

1) What are the datatypes of the column of the dataset.

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 909 entries, 0 to 908
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FF      909 non-null    int64
 1   Title   909 non-null    object
 2   DIR     909 non-null    object
dtypes: int64(1), object(2)
memory usage: 21.4+ KB

2) Get the Basic Statistics of Dataset.

In [10]:
data.describe()

                FF
count   909.000000
mean   2011.656766
std       3.506274
min    2005.000000
25%    2009.000000
50%    2012.000000
75%    2015.000000
max    2017.000000

3) Calculate the Length of the string in Title.

In [12]:
len(data['Title'])

909

4) Calculate the Length of the DIR column in dataset

In [13]:
len(data['DIR'])

909

5) Check for the Datatype after checking the Length of the Title and DIR columns.

In [21]:
data.dtypes

FF        int64
Title    object
DIR      object
dtype: object

6) Convert Title column back to Object format from Numeric.

In [26]:
data['Title'] = data['Title'].astype(object)

7) Convert DIR column back to Object format from Numeric.

In [27]:
data.dtypes

FF        int64
Title    object
DIR      object
dtype: object

In [28]:
data['DIR']=data['DIR'].astype(object)

8) Checking the Datatype after converting back to Object.

In [29]:
data.dtypes

FF        int64
Title    object
DIR      object
dtype: object

9) Convert the Director's name in Upper case.

In [30]:
data.head()

     FF                             Title                DIR
0  2005              1990: Bronx Warriors    Enzo Castellari
1  2005                             Creep  Christopher Smith
2  2005                             Feast       John Gulager
3  2005                          G.O.R.A.  ÌÐmer Faruk Sorak
4  2005  Hakugei: Legend of the Moby Dick       Osamu Dezaki

In [36]:
data['DIR']=data['DIR'].str.upper()

In [37]:
data

,FF,Title,DIR
0,2005,1990: Bronx Warriors,ENZO CASTELLARI
1,2005,Creep,CHRISTOPHER SMITH
2,2005,Feast,JOHN GULAGER
3,2005,G.O.R.A.,ÌÐMER FARUK SORAK
4,2005,Hakugei: Legend of the Moby Dick,OSAMU DEZAKI
...,...,...,...
904,2017,See You Up There,ALBERT DUPONTEL
905,2017,Tabula Rasa,JONAS GOVAERTS & KAAT BEELS / MALIN-SARAH GOZIN
906,2017,Wizard,KAGISO LEDIGA
907,2017,"Death of Stalin, The",ARMANDO IANNUCCI
908,2017,Take It Out in Trade,EDWARD D. WOOD JR.

10) Replace the & in the DIR column with and.

In [42]:
data['DIR'].replace('&','and')

0                                      ENZO CASTELLARI
1                                    CHRISTOPHER SMITH
2                                         JOHN GULAGER
3                                    ÌÐMER FARUK SORAK
4                                         OSAMU DEZAKI
                            ...
904                                    ALBERT DUPONTEL
905    JONAS GOVAERTS & KAAT BEELS / MALIN-SARAH GOZIN
906                                      KAGISO LEDIGA
907                                   ARMANDO IANNUCCI
908                                 EDWARD D. WOOD JR.
Name: DIR, Length: 909, dtype: object

11) Remove the white space from the Left side of the string for Director column.

In [44]:
data['DIR'].str.lstrip()

0                                      ENZO CASTELLARI
1                                    CHRISTOPHER SMITH
2                                         JOHN GULAGER
3                                    ÌÐMER FARUK SORAK
4                                         OSAMU DEZAKI
                            ...
904                                    ALBERT DUPONTEL
905    JONAS GOVAERTS & KAAT BEELS / MALIN-SARAH GOZIN
906                                      KAGISO LEDIGA
907                                   ARMANDO IANNUCCI
908                                 EDWARD D. WOOD JR.
Name: DIR, Length: 909, dtype: object

12) Remove the white space from the right side of the string for Director column.

In [45]:
data['DIR'].str.rstrip()

0                                      ENZO CASTELLARI
1                                    CHRISTOPHER SMITH
2                                         JOHN GULAGER
3                                    ÌÐMER FARUK SORAK
4                                         OSAMU DEZAKI
                            ...
904                                    ALBERT DUPONTEL
905    JONAS GOVAERTS & KAAT BEELS / MALIN-SARAH GOZIN
906                                      KAGISO LEDIGA
907                                   ARMANDO IANNUCCI
908                                 EDWARD D. WOOD JR.
Name: DIR, Length: 909, dtype: object

13) Show the name of director with minimum length.

In [46]:
len(data['DIR'].min())

33

14) Show the name of director with maximum length.

In [47]:
len(data['DIR'].max())

16

15) Remove the white space from the Left side of the string for Title column.

In [48]:
data['Title'].str.lstrip()

0                  1990: Bronx Warriors
1                                 Creep
2                                 Feast
3                              G.O.R.A.
4      Hakugei: Legend of the Moby Dick
                     ...
904                    See You Up There
905                         Tabula Rasa
906                              Wizard
907                Death of Stalin, The
908                Take It Out in Trade
Name: Title, Length: 909, dtype: object

16) Remove the white space from the right side of the string for Title column.

In [50]:
data['Title'].str.rstrip()

0                  1990: Bronx Warriors
1                                 Creep
2                                 Feast
3                              G.O.R.A.
4      Hakugei: Legend of the Moby Dick
                     ...
904                    See You Up There
905                         Tabula Rasa
906                              Wizard
907                Death of Stalin, The
908                Take It Out in Trade
Name: Title, Length: 909, dtype: object

17) Show the title of movie with minimum length.

In [52]:
data['Title'].min()

'1%'

18) Show the title of movie with maximum length.

In [53]:
data['Title'].max()

'mon mon mon MONSTERS'

19) Concatenate Title and directors with a space in between.

In [54]:
data.head()

     FF                             Title                DIR
0  2005              1990: Bronx Warriors    ENZO CASTELLARI
1  2005                             Creep  CHRISTOPHER SMITH
2  2005                             Feast       JOHN GULAGER
3  2005                          G.O.R.A.  ÌÐMER FARUK SORAK
4  2005  Hakugei: Legend of the Moby Dick       OSAMU DEZAKI

In [56]:
data['Title']+' '+data['DIR']

0                   1990: Bronx Warriors ENZO CASTELLARI
1                                Creep CHRISTOPHER SMITH
2                                     Feast JOHN GULAGER
3                             G.O.R.A. ÌÐMER FARUK SORAK
4          Hakugei: Legend of the Moby Dick OSAMU DEZAKI
                             ...
904                     See You Up There ALBERT DUPONTEL
905    Tabula Rasa JONAS GOVAERTS & KAAT BEELS / MALI...
906                                 Wizard KAGISO LEDIGA
907                Death of Stalin, The ARMANDO IANNUCCI
908              Take It Out in Trade EDWARD D. WOOD JR.
Length: 909, dtype: object

20) Find the Hostel movie from the Title list.

In [57]:
data.head()

     FF                             Title                DIR
0  2005              1990: Bronx Warriors    ENZO CASTELLARI
1  2005                             Creep  CHRISTOPHER SMITH
2  2005                             Feast       JOHN GULAGER
3  2005                          G.O.R.A.  ÌÐMER FARUK SORAK
4  2005  Hakugei: Legend of the Moby Dick       OSAMU DEZAKI

In [59]:
data[data['Title']=='Hostel']

     FF   Title       DIR
5  2005  Hostel  ELI ROTH

21) Find the Ryan Schifrin from the Director's list.

In [61]:
data[data['DIR']=='Ryan Schifrin']

Empty DataFrame
Columns: [FF, Title, DIR]
Index: []

In [63]:
data['DIR'].str.find('Ryan Schifrin')

0     -1
1     -1
2     -1
3     -1
4     -1
      ..
904   -1
905   -1
906   -1
907   -1
908   -1
Name: DIR, Length: 909, dtype: int64

22) Replace the space in Title name with underscore.

In [65]:
data['Title'].str.replace(' ','_')

0                  1990:_Bronx_Warriors
1                                 Creep
2                                 Feast
3                              G.O.R.A.
4      Hakugei:_Legend_of_the_Moby_Dick
                     ...
904                    See_You_Up_There
905                         Tabula_Rasa
906                              Wizard
907                Death_of_Stalin,_The
908                Take_It_Out_in_Trade
Name: Title, Length: 909, dtype: object

23) Replace the space in Dir name with underscore.

In [67]:
data['DIR'].str.replace(' ','_')

0                                      ENZO_CASTELLARI
1                                    CHRISTOPHER_SMITH
2                                         JOHN_GULAGER
3                                    ÌÐMER_FARUK_SORAK
4                                         OSAMU_DEZAKI
                            ...
904                                    ALBERT_DUPONTEL
905    JONAS_GOVAERTS_&_KAAT_BEELS_/_MALIN-SARAH_GOZIN
906                                      KAGISO_LEDIGA
907                                   ARMANDO_IANNUCCI
908                                 EDWARD_D._WOOD_JR.
Name: DIR, Length: 909, dtype: object